{"root":{"context":"http://schema.org/","id":"https://www.skillshare.com/classes/Bootstrap-to-WordPress-Build-Custom-Responsive-themes/1383561460undefined","name":"Bootstrap to WordPress: Build Custom Responsive themes!","description":"a stunning custom Wordpress theme from scratch using the responsive Bootstrap framework. Also covers PHP basics.WordPress is the most popular CMS on the web and powers a large percentage of websites today. In this course i will guide you step by step, to building your own custom responsive theme using the popular Boostrap framework.No more looking around for pre built themes and making them fit your website. Or even paying for themes on sites such as Themeforest.This course will give you the knowledge to either build your own custom site and convert to WordPress, or convert your existing static HTML website to WordPress!*** IMPORTANT UPDATE ***When following along with this course we will be downloading Bootstrap (lecture 2), a Bootstrap blog template (lecture 11) and WordPress (lecture 16).From time to time the contents of the downloads can change and you may notice a slight difference between versions. If you are having trouble with a later version or would prefer to use the same versions as I am in the videos, i have included all 3 in the download section of the project area.If not follow along with the course as usual!","image":"https://static.skillshare.com/uploads/video/thumbnails/743aaffd7f23313c19229d718d536f39/448-252","provider":{"name":"Skillshare","sameAs":"https://www.skillshare.com","logo":"https://static.skillshare.com/assets/images/hands_logo_2x.png","type":"Organizationundefined","__text":"undefined"},"author":{"name":"Chris Dixon","sameAs":"https://www.skillshare.com/profile/Chris-Dixon/4242758","image":"https://static.skillshare.com/uploads/users/4242758/user-image-medium.png?464610875","type":"Personundefined","__text":"undefined\nundefined\nundefined\nundefined"},"type":"Courseundefined","__text":"undefined\nundefined\nundefined\nundefined\nundefined\nundefined"}}