{"root":{"context":"http://schema.org/","id":"https://www.skillshare.com/classes/Master-Android-App-Design-in-Photoshop-using-Google-Material-Design-Guide/2094148985undefined","name":"Master Android App Design in Photoshop using Google Material Design Guide","description":"Designing sleek Android Apps using Google Material Design system is no joke. You need to know all the sizes, spacing and metrics for Designing seamless Android App experiences. So how do you Design which your Developers can actually turn in coded Apps. So this course will uncover the mysteries of Designing Android Apps using Material Design in Adobe Photoshop. You will learn How to convert DPs and SP Material Design units to Pixels (PX) Which template size to start with? What are Density Buckets and how do we design for all the different Android Phone Resolutions?How to theme your App using Google Material  Colors?Understand all the Specs and Sizes and Typographic Grids of Material Design What's new and possible with Material Design 2.0?Design a real world actual App using Photoshop art boards Extract all your assets using Photoshop Handoff your Android Designs to your Developers using Zeplin What are 9-patch PNG assets and how to generate them?Generate Coded Style Guides for your Android Developers Design 6 Android App Screens of a Medical App using Photoshop So you will deep dive into Google Material Design using Adobe Photoshop and Handoff your designs using Zeplin to give your Developer coded Style GuidesSo lets start learning together","image":"https://static.skillshare.com/uploads/video/thumbnails/0cbaa091f260e4afcb9c9a8fe4f2b3d6/448-252","provider":{"name":"Skillshare","sameAs":"https://www.skillshare.com","logo":"https://static.skillshare.com/assets/images/hands_logo_2x.png","type":"Organizationundefined","__text":"undefined"},"author":{"name":"Muhammad Ahsan","sameAs":"https://www.skillshare.com/user/ahsanidrisi","image":"https://static.skillshare.com/uploads/users/1830675/user-image-medium.jpg?1177464673","type":"Personundefined","__text":"undefined\nundefined\nundefined\nundefined"},"type":"Courseundefined","__text":"undefined\nundefined\nundefined\nundefined\nundefined\nundefined"}}